---
kind: property
id: P:Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.ExternalResourceUIService
source: html/b5f92f62-4f0f-ecb9-9914-4155f6df9019.htm
---
# Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.ExternalResourceUIService Property

The external UI service Id which permits registration of an alternate servers for managing error messages
 which happen at the loading of the references to external resources such as linked files.

## Syntax (C#)
```csharp
public static ExternalServiceId ExternalResourceUIService { get; }
```